ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr_peripherals.h
#define PWM120_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM120_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM120_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM120_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM120_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM120_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM120_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM120_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM120_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM120_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM120_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM130_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM130_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM130_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM130_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM130_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM130_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM130_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM130_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM130_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM130_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM130_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM131_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM131_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM131_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM131_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM131_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM131_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM131_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM131_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM131_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM131_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM131_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM132_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM132_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM132_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM132_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM132_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM132_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM132_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM132_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM132_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM132_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM132_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM133_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM133_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM133_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM133_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM133_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM133_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM133_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM133_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM133_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM133_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM133_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

