ankuns/nrfx/bsp/stable/mdk/nrf7140_flpr_peripherals.h
#define TWIM135_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIM135_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIM135_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIM135_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIM135_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIM135_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIM135_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM135_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIM135_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIM135_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM135_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM135_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIM135_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

#define TWIM136_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIM136_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIM136_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIM136_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIM136_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIM136_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIM136_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM136_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIM136_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIM136_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM136_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM136_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIM136_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

#define TWIM137_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIM137_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIM137_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIM137_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIM137_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIM137_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIM137_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIM137_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIM137_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIM137_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM137_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM137_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIM137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIM137_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

/*I2C compatible Two-Wire Slave Interface with EasyDMA*/
#define TWIS_PRESENT 1
#define TWIS_COUNT 8

#define TWIS130_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIS130_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIS130_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS130_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS130_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS130_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIS130_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS130_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIS130_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIS130_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS130_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS130_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIS130_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

